"Doctor Walser first used the MRI-guided laser procedure in June. The\nMayo Clinic reported that he had successfully treated five patients by the\nmiddle of October.\nEarlier this year, doctors at the Mayo Clinic in Minnesota used MRI-guided\nlaser ablation to remove tumors of the prostate. Doctor David Woodrum\nhas successfully treated seven prostate patients with the procedure. He\nsays it provides for a less invasive and less traumatic experience.\nThe process is still being developed, but doctors say it could prove to be\nsuccessful for treating most cancers in the body. The doctors say it\nshould only be used on tumors that are less than five centimeters in size.\nMalaria kills about one million people a year and sickens another two\nhundred fifty million. Most of the deaths are in young children in\nAfrica. People become infected when they are bitten by mosquitoes\ncarrying the malaria parasite.\nA new report estimates the possibility of ending malaria in countries that\nhave the deadliest form of the disease. Researchers found that this could\nbe possible in most parts of the world within ten to fifteen years. What it\nwould require, they say, is reducing the spread of malaria by ninety\npercent from two thousand seven rates.\nAn international team created mathematical models and maps of areas\nwhere the disease is gone or almost gone. The report says malaria could\nbe eliminated if countries are serious about using proven control measures\nlike insecticides and bed nets.\nThe Bill and Melinda Gates Foundation partly financed the research. The\nstudy appears in The Lancet medical journal.\nSome malaria experts expressed concern about giving too much attention\nto eliminating the disease. They say such a goal could take many years, if\nit is possible at all. The concern is that resources for controlling malaria\ncould be lost if the money is spent instead on efforts to defeat it.\nA new study shows that long, severe droughts may strike countries with\nlarge populations in the not-so-distant future. The study was made for\nAmerica's National Center for Atmospheric Research.\nNCAR scientist Aiguo Dai led the research. It shows that drought\nconditions will threaten most of North and South America by the end of\n"